# テーブルを作成する  
## 方針
各チャブターのテーブルは
- 'chapXX.db'というDBに放り込む
- テーブル名は書籍に準ずる

In [1]:
import os
import numpy as np
import pandas as pd

In [10]:
import sqlite3
def add_table(table, table_name, folder_path, dbname):
    # make connection to the db
    conn = sqlite3.connect(folder_path + dbname)

    # make cursor object for opearating sqlite
    cur = conn.cursor()

    # create table TestResults
    table.to_sql(table_name, conn, if_exists='replace')

    # confirm table
    select_sql = 'SELECT * FROM ' + table_name + ';'
    for row in cur.execute(select_sql):
        print(row)

    cur.close()
    conn.close()
    
    print('success')

# chap7のDB作成

In [2]:
TestResults = pd.DataFrame(
    {
        'student_id':[str(e).zfill(3) for e in range(1,16)],
        'class':['A']*4 + ['B']*5 + ['C']*3 + ['D'] * 3,
        'sex':['male' if e == 1 else 'female' for e in [1,0,0,1,0,1,1,1,0,1,1,0,0,0,0]],
        'score':[100, 100, 49, 30, 100, 92, 80, 80, 10, 92, 80, 21, 100, 0, 0]
    }
)

In [3]:
TestResults

   student_id class     sex  score
0         001     A    male    100
1         002     A  female    100
2         003     A  female     49
3         004     A    male     30
4         005     B  female    100
5         006     B    male     92
6         007     B    male     80
7         008     B    male     80
8         009     B  female     10
9         010     C    male     92
10        011     C    male     80
11        012     C  female     21
12        013     D  female    100
13        014     D  female      0
14        015     D  female      0

In [6]:
add_table(table = TestResults, table_name = 'TestResults',
          folder_path = '../dataset/', dbname = 'chap07.db')

(0, '001', 'A', 'male', 100)
(1, '002', 'A', 'female', 100)
(2, '003', 'A', 'female', 49)
(3, '004', 'A', 'male', 30)
(4, '005', 'B', 'female', 100)
(5, '006', 'B', 'male', 92)
(6, '007', 'B', 'male', 80)
(7, '008', 'B', 'male', 80)
(8, '009', 'B', 'female', 10)
(9, '010', 'C', 'male', 92)
(10, '011', 'C', 'male', 80)
(11, '012', 'C', 'female', 21)
(12, '013', 'D', 'female', 100)
(13, '014', 'D', 'female', 0)
(14, '015', 'D', 'female', 0)

## Teams

In [10]:
Teams = pd.DataFrame(
    {
        'member': ['Joe', 'Ken', 'Mik', 'Karen', 'Keith', 'Jan', 'Hart', 'Dick', 'Beth', 'Alen', 'Robert', 'Kagan'],
        'team_id': [1,1,1,2,2,3,3,3,4,5,5,5],
        'status':['ready', 'active', 'ready', 'active', 'absence', 'ready', 'ready', 'ready', 'ready', 'active', 'absence', 'ready'],
    }
)

In [11]:
Teams

    member  team_id   status
0      Joe        1    ready
1      Ken        1   active
2      Mik        1    ready
3    Karen        2   active
4    Keith        2  absence
5      Jan        3    ready
6     Hart        3    ready
7     Dick        3    ready
8     Beth        4    ready
9     Alen        5   active
10  Robert        5  absence
11   Kagan        5    ready

In [13]:
add_table(table = Teams, table_name = 'Teams',
          folder_path = '../dataset/', dbname = 'chap07.db')

(0, 'Joe', 1, 'ready')
(1, 'Ken', 1, 'active')
(2, 'Mik', 1, 'ready')
(3, 'Karen', 2, 'active')
(4, 'Keith', 2, 'absence')
(5, 'Jan', 3, 'ready')
(6, 'Hart', 3, 'ready')
(7, 'Dick', 3, 'ready')
(8, 'Beth', 4, 'ready')
(9, 'Alen', 5, 'active')
(10, 'Robert', 5, 'absence')
(11, 'Kagan', 5, 'ready')

# Materials

In [5]:
center = ['tokyo'] * 4 + ['osaka'] * 3 + ['nagoya'] * 5 + ['fukuoka'] * 2
center

['tokyo',
 'tokyo',
 'tokyo',
 'tokyo',
 'osaka',
 'osaka',
 'osaka',
 'nagoya',
 'nagoya',
 'nagoya',
 'nagoya',
 'nagoya',
 'fukuoka',
 'fukuoka']

In [6]:
y = ['2018'] * 14
m = [str(e).zfill(2) for e in [4,4,5,5,4,4,4,3,4,4,5,5,5,5]]
d = [str(e).zfill(2) for e in [1,12,17,20,20,22,29,15,1,24,2,10,10,28]]

receive_date = ['-'.join(e) for e in zip(y, m, d)]
receive_date

['2018-04-01',
 '2018-04-12',
 '2018-05-17',
 '2018-05-20',
 '2018-04-20',
 '2018-04-22',
 '2018-04-29',
 '2018-03-15',
 '2018-04-01',
 '2018-04-24',
 '2018-05-02',
 '2018-05-10',
 '2018-05-10',
 '2018-05-28']

In [7]:
material = ['tin', 'zinc', 'aluminum', 'zinc', 'copper', 'nickel', 'lead', 'titanium', 'carbon-steel', 'carbon-steel',
           'magnesium', 'titanium', 'zinc', 'tin']

material

['tin',
 'zinc',
 'aluminum',
 'zinc',
 'copper',
 'nickel',
 'lead',
 'titanium',
 'carbon-steel',
 'carbon-steel',
 'magnesium',
 'titanium',
 'zinc',
 'tin']

In [8]:
Materials = pd.DataFrame(
    {
        'center':center,
        'receive_date':receive_date,
        'material':material
    }
)

Materials

     center receive_date      material
0     tokyo   2018-04-01           tin
1     tokyo   2018-04-12          zinc
2     tokyo   2018-05-17      aluminum
3     tokyo   2018-05-20          zinc
4     osaka   2018-04-20        copper
5     osaka   2018-04-22        nickel
6     osaka   2018-04-29          lead
7    nagoya   2018-03-15      titanium
8    nagoya   2018-04-01  carbon-steel
9    nagoya   2018-04-24  carbon-steel
10   nagoya   2018-05-02     magnesium
11   nagoya   2018-05-10      titanium
12  fukuoka   2018-05-10          zinc
13  fukuoka   2018-05-28           tin

In [11]:
add_table(table = Materials, table_name = 'Materials',
          folder_path = '../dataset/', dbname = 'chap07.db')

(0, 'tokyo', '2018-04-01', 'tin')
(1, 'tokyo', '2018-04-12', 'zinc')
(2, 'tokyo', '2018-05-17', 'aluminum')
(3, 'tokyo', '2018-05-20', 'zinc')
(4, 'osaka', '2018-04-20', 'copper')
(5, 'osaka', '2018-04-22', 'nickel')
(6, 'osaka', '2018-04-29', 'lead')
(7, 'nagoya', '2018-03-15', 'titanium')
(8, 'nagoya', '2018-04-01', 'carbon-steel')
(9, 'nagoya', '2018-04-24', 'carbon-steel')
(10, 'nagoya', '2018-05-02', 'magnesium')
(11, 'nagoya', '2018-05-10', 'titanium')
(12, 'fukuoka', '2018-05-10', 'zinc')
(13, 'fukuoka', '2018-05-28', 'tin')
success

# Items and ShopItems

In [12]:
Items = pd.DataFrame(
    {
        'item':['beer', 'paper-diapers', 'bycycle']
    }
)

Items

            item
0           beer
1  paper-diapers
2        bycycle

In [14]:
ShopItems = pd.DataFrame(
    {
        'shop':['sendai'] * 4 + ['tokyo'] * 3 + ['osaka'] * 3,
        'item':['beer', 'paper-diapers', 'bycycle', 'curtain', 'beer', 'paper-diapers', 'bycycle', 'television',
                'paper-diapers', 'bycycle']
    })
ShopItems

     shop           item
0  sendai           beer
1  sendai  paper-diapers
2  sendai        bycycle
3  sendai        curtain
4   tokyo           beer
5   tokyo  paper-diapers
6   tokyo        bycycle
7   osaka     television
8   osaka  paper-diapers
9   osaka        bycycle

In [15]:
add_table(
    table=Items,
    table_name='Items',
    folder_path='../dataset/',
    dbname='chap07.db'
)

(0, 'beer')
(1, 'paper-diapers')
(2, 'bycycle')
success

In [16]:
add_table(
    table=ShopItems,
    table_name='ShopItems',
    folder_path='../dataset/',
    dbname='chap07.db'
)

(0, 'sendai', 'beer')
(1, 'sendai', 'paper-diapers')
(2, 'sendai', 'bycycle')
(3, 'sendai', 'curtain')
(4, 'tokyo', 'beer')
(5, 'tokyo', 'paper-diapers')
(6, 'tokyo', 'bycycle')
(7, 'osaka', 'television')
(8, 'osaka', 'paper-diapers')
(9, 'osaka', 'bycycle')
success